In [11]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [12]:
Index = [1,2,3]
names = ['Ali', 'Saeed', 'Moath']
s = pd.Series(names, index=Index)
s

1      Ali
2    Saeed
3    Moath
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [13]:
s = pd.Series(names, index=[11,12,13])
s

11      Ali
12    Saeed
13    Moath
dtype: object

## Q3: Retrieve First and second elements.

In [14]:
s[0:2]

C:\Users\moaat\AppData\Local\Temp\ipykernel_21700\495490612.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  s[0:2]

11      Ali
12    Saeed
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [15]:
s1 = s.copy()
s = s.append(s1, ignore_index=True)
s

C:\Users\moaat\AppData\Local\Temp\ipykernel_21700\3867580065.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s = s.append(s1, ignore_index=True)

0      Ali
1    Saeed
2    Moath
3      Ali
4    Saeed
5    Moath
dtype: object

In [17]:
s = s.drop_duplicates()
s

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [20]:
data = {
    'ID':[11],
    'Name':['Ali']
} 
Students = pd.DataFrame(data, columns=['ID', 'Name'])
Students

   ID Name
0  11  Ali

## Q6: Read educ_figdp_1_Data.csv file

In [22]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [29]:
edu[5:11]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e

In [23]:
edu.loc[5:11]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e

In [28]:
edu.loc[5:11,['TIME', 'GEO', 'Value']]

    TIME                            GEO Value
5   2005  European Union (28 countries)  4.92
6   2006  European Union (28 countries)  4.91
7   2007  European Union (28 countries)  4.92
8   2008  European Union (28 countries)  5.04
9   2009  European Union (28 countries)  5.38
10  2010  European Union (28 countries)  5.41
11  2011  European Union (28 countries)  5.25

In [43]:
edu[-1:1]

Empty DataFrame
Columns: [TIME, GEO, INDIC_ED, Value, Flag and Footnotes]
Index: []

In [42]:
edu.loc[-1:1]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [46]:
edu.loc[1:1]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN